//=============================================================================
//
// 食べ物ベース [food base.h]
// Author : 吉田悠人
//
//=============================================================================
#ifndef _BAIT_H_
#define _BAIT_H_
//=============================================================================
// ヘッダーファイル
//=============================================================================
#include "model.h"
#include "billboard.h"

//=============================================================================
// クラス定義
//=============================================================================
class CFoodBase :public CBillboard
{
public:
	CFoodBase();
	~CFoodBase();

	void	Update(void);

	void	Collision(void);					// 当たり判定関数
	void	SetPoint(int nPoint);				// ポイントセッター
	int		GetPoint(void) { return m_nPoint; }	// ポイントゲッター

private:

	int m_nPoint;		//ポイント数値

};

#endif