//=============================================================================
//
// プレイヤー [player.h]
// Author : 吉田悠人
//
//=============================================================================
#ifndef _PLAYER_H_
#define _PLAYER_H_

//=============================================================================
// ヘッダーファイル
//=============================================================================
#include "scene3d.h"
#include "model.h"

//=============================================================================
// 前方宣言
//=============================================================================
class CPlayerParts;
//=============================================================================
// マクロ定義
//=============================================================================
#define MAX_PARTS (20)	//最大パーツ数

//=============================================================================
//クラス定義
//=============================================================================
class CPlayer : public CModel
{
public:
	CPlayer(int nPriority = 3);
	~CPlayer();

	static CPlayer* Create(D3DXVECTOR3 Pos, D3DXVECTOR3 Rot, D3DXVECTOR3 Size);

	HRESULT			Init(void);
	void			Update(void);

	void			AddParts(void);	// パーツ追加（食べ物を食べた後の追加パーツ）処理関数

private:
	void			Move(void);	// 移動処理
	void			Rot(void);	// 向き処理

	const int	m_nModel = 1;	// モデル番号
	int			m_nLife;		// ライフ

	int				m_nParts;				// パーツ数
	CPlayerParts*	m_pParts[MAX_PARTS];	// パーツポインタ
};
#endif // !_BLOCK_H_


